// import figlet from "figlet";
// import standard from "figlet/importable-fonts/Standard.js";

// export function consoleLogText(inputText: string) {

//     figlet.parseFont("Standard", standard);

//     figlet.text(inputText, {
//         font: 'Standard',   //Ghost , Standard , Graffiti , Dancing Font , Slant , Pagga
//         horizontalLayout: 'default',
//         verticalLayout: 'default',
//         width: 100,
//         whitespaceBreak: true
//     }, function (err, data) {
//         if (err) {
//             console.log('Something went wrong...');
//             console.dir(err);
//             return;
//         }
//         console.log(data + emoji_heart);
//     });
// }

const emoji_heart = `
˚∧ ＿∧             —̳͟͞͞💗
(  •‿• )つ  —̳͟͞͞ 💗         —̳͟͞͞💗
(つ　  <                —̳͟͞͞💗
｜　 _ つ        —̳͟͞͞💗         —̳͟͞͞💗 ˚
し'
`
const emoji_muyaho = `
⠀⠀⢰⠒⠒⠒⢲⠆⠀⠀⢀⠤⢤⡀⠀⡴⠀⠀⢀⣀⣀⣰⣀⣀⡀⠀⠀⠀⠀⠀
⠀⠀⣎⣀⣀⣀⡜⠀⠀⢰⠃⠀⢠⠇⢰⠓⠂⠀⢀⠔⠒⠒⠲⡄⠀⠀⠀⠀⠀⠀
⠤⠤⠤⣤⠤⠤⠤⠄⠀⣇⠀⢀⠞⢀⡯⠤⠀⠀⠹⠤⡤⠤⠞⠁⠀⢠⠔⢤⣀⠆
 ⠀⠀⢀⡏⠀⠀⠀⠀⠀⠈⠉⠁⠀⡸⠀⠀⠠⠤⠤⠴⠧⠤⠤⠄⠀⠀
`

const emoji_thinking = `
＼＿＿＿＿＿＿＿＿／
　　ｏ
　　 。
　　　｡
　　∧＿∧
　 (*　･ω･)
＿(__つ/￣￣￣/_
　　＼/　　　/
`

const emoji_cat = `
＼　　ヽ　　　　i　　|　　　　 /　　　/
　　　＼
give me a one dallor!
　　　　　　　　　　　　　　;' ':;,　　 　　　 ,;'':;,
　　　　　　　　　　　　　;'　　 ':;,.,..,,,;'　　　';,
　　ー　　　　　　　　 ,:'　　　　　　　　 　　　　::::::::､
　_＿　　　　　　　　,:' ／ 　 　　　　＼ 　　　　　::::::::',
　　　　　二　　　　:'　 ●　　　　　 ●　 　　　　　　::::::::i.
　　￣　　　　　　　i　'''　(_人__)　　''''　　 ::::::::::i
　　　　-‐　　　　　 :　 　　　　　　　　　 　　　　　::::::::i
　　　　　　　　　　　':,､ 　　　　　 　 　　　 :::::::::: /
　　　　／　　　　　　 ,:'　　　　　　　 : ::::::::::::｀:､
　　　　　　　　　　　 ,:'　　　　　　　　 : : ::::::::::｀:､
`

const emoji_sleep = `
.　  ∧＿∧
　  (・ω・)
┏ーー∪ー∪ーー┓
┃＼　　　　　／┃
┃　＼　♡　／　┃
┃　／＼＿／＼　┃
┗ー━ー━ー━ー━ー┛
`

const emoji_wonder = `
뀨？　　 ／￣￣＼
　　　 ／ 　●・ ＞
　　 ／　 　ε　 │
　 ／　　 　●・ ＞
　(つ＿と＼＿＿／
　 ∪　∪
`

const emoji_lamar = `
Δ~~~~~Δ
ξ ･ェ･ ξ
ξ　~　 ξ   ~iiii~
ξ　 　 ξ   ┎★☆┒
ξ　　　“~~~~~~～〇
ξ               ξ
ξ ξ  ξ~~~~ξ  ξ  ξ
ξ_ξξ_ξ　   ξ_ξξ_ξ
`

const emoji_mouse = `
ᘏ_____ᘏ
|・ㅅ・|
|っ　ｃ|
|　　　|
|　　　|
|　　　|
|　　　|
U￣￣￣U
`

const emoji_cry = `
.　　　ヘ　 ヘ
　　　/　＼/　＼
　　／　　　　　ヽ
　 /　　ㅇ　　 ㅇ |
　｜　∪　/￣￣T　|
　｜∪　 ｜　　|　|
　 ＼　　｜＿　| ノ
　 ／　ヽ｜　ヽ|、
　(　　 |｜　 ||｜
　|　　 ヽ二二ノ｜
　|　 L　　　　｣｜
　ヽ＿ﾉ　　　 (_/
　　｜　　/　 /
　　｜　 /　 /
　　(＿＿)＿_)
`